In [1]:
## mysql 연동
import pymysql
import pandas as pd
conn = pymysql.connect(host='127.0.0.1'
                , port=3306
                , user = 'root'
                , password='root1234'
                , db = 'movie_pj'
                , charset='utf8'
                )

In [2]:
name="김헌수"
age=25
sex="M"
oc="teacher"
sql=f'Insert into users(user_id,age,sex,occupation) values((select max(a.user_id)+1 from users a), {int(age)}, "{sex}", "{oc}");'
cursor = conn.cursor()
cursor.execute(sql)

1

In [3]:
conn.commit()
conn.close()

In [4]:
conn = pymysql.connect(host='127.0.0.1'
                , port=3306
                , user = 'root'
                , password='root1234'
                , db = 'movie_pj'
                , charset='utf8'
                )

In [6]:
users2=pd.read_sql("select*from users",conn)
users2.tail()

C:\Users\Playdata\AppData\Local\Temp\ipykernel_6156\2387345850.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  users2=pd.read_sql("select*from users",conn)

     user_id  age sex     occupation
939      939   32   M  administrator
940      940   20   M        student
941      941   48   F      librarian
942      942   22   M        student
943      943   25   M        teacher